#### SystemZoneData Members

---

|  |
| --- |
| SystemZoneData Class   Methods   Properties   See Also |

The  SystemZoneData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of a system-zone data domain class. |
| Public method | Dispose | (Inherited from  GenericZoneDomainData  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  GenericZoneDomainData  .) |
| Public property | ZoneEquipmentId | The id of the zone equipment related to the zone. |

# See Also

SystemZoneData Class

Autodesk.Revit.DB.Mechanical Namespace